app/controllers/categories_controller.rb

  def load_products
    begin
      resource.products
    rescue
      Product.all
---
SELECT "products".* FROM "products"