app/controllers/products_controller.rb

  def load_reviews
    @reviews = resource.reviews.to_a
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = ?  [["product_id", 1]]