app/views/categories/_list.html.haml

SELECT "categories".* FROM "categories"
---
.list-group
  = link_to t(:all_categories), categories_path, class: "list-group-item #{'active' if params[:id].nil? && params[:category].blank?}"